LonelyWolf/stm32/bike-computer/GUI.c
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_rtc.h>

#include <wolk.h>
#include <uc1701.h>
#include <GUI.h>
#include <GPS.h>
#include <RTC.h>
#include <beeper.h> // <----- just for debug, remove it later

#include <font5x7.h>
#include <font7x10.h>
#include <resources.h>


bool GUI_refresh;                     // Flag to refresh GUI
bool GUI_new_BMP180;                  // BMP180 data updated


// Callback function for change display brightness settings
void callback_Brightness(int32_t param) {
	Settings.LCD_brightness = substDisplayBrightness.Items[param].subst_val;
	UC1701_SetBacklight(Settings.LCD_brightness);
}

// Draw bitmap
// input:
//   X, Y - top left corner coordinates of bitmap
//   W, H - width and height of bitmap in pixels
//   pBMP - pointer to array containing bitmap
void GUI_DrawBitmap(uint8_t X, uint8_t Y, uint8_t W, uint8_t H, const uint8_t* pBMP) {
	uint8_t i,j;

	for (i = 0; i < W; i++) {
		for (j = 0; j < H; j++) {
			if ((pBMP[i + (j / 8) * W] >> (j % 8)) & 0x01) {
				SetPixel(X + i, Y + j);
			} else {
				ResetPixel(X + i, Y + j);
			}
		}
	}
}

// Big digit
void GUI_BigDig(uint8_t X, uint8_t Y, uint8_t digit) {
	GUI_DrawBitmap(X,Y,14,34,&big_digits[(digit * 70)]);
}

// Middle digit
void GUI_MidDig(uint8_t X, uint8_t Y, uint8_t digit) {
	GUI_DrawBitmap(X,Y,10,22,&mid_digits[(digit * 30)]);
}

// Small digit
void GUI_SmallDig(uint8_t X, uint8_t Y, uint8_t digit) {
	GUI_DrawBitmap(X,Y,9,19,&small_digits[(digit * 27)]);
}

// Draw number with big digits
// input:
//   X - left horizontal coordinate of number
//       if this value is negative -> number right horizontal coordinate
//   Y - top vertical coordinate of number
//       if this value is negative -> number bottom vertical coordinate
//   number - number to display
//   decimals - number of decimal digits (0..4)
//   DigitSize - type of digit (DS_Big, DS_Mid, DS_Small)
void GUI_DrawNumber(int8_t X, int8_t Y, int32_t Number, uint8_t Decimals,
		DigitSize_TypeDef DigitSize) {
	uint8_t i = 0;
	int32_t num = Number;
	uint8_t xx = X;
	uint8_t dig_w,dig_h; // Digit width and height
	uint8_t dig_int; // Interval between digits
	uint8_t dec_w,dec_h; // Decimal point width and height
	const uint8_t *dig_offset; // Offset to digit bitmap
	uint16_t dig_len; // Length of digit bitmap
	uint8_t buf[12];
	uint8_t strLen; // String length
	uint8_t neg; // Negative flag
	uint8_t minus_w,minus_h; // Width and height of minus sign
	uint8_t minus_t; // Top coordinate of minus sign
	uint8_t num_width; // Number width

	switch(DigitSize) {
	case DS_Mid:
		dig_w = 10;
		dig_h = 22;
		dig_len = 30;
		dig_offset = mid_digits;
		dig_int = 1;
		dec_w = 2;
		dec_h = 3;
		minus_w = 5;
		minus_h = 2;
		minus_t = 9;
		break;
	case DS_Small:
		dig_w = 9;
		dig_h = 19;
		dig_len = 27;
		dig_offset = small_digits;
		dig_int = 1;
		dec_w = 2;
		dec_h = 3;
		minus_w = 4;
		minus_h = 2;
		minus_t = 8;
		break;
	default:
		dig_w = 14;
		dig_h = 34;
		dig_len = 70;
		dig_offset = big_digits;
		dig_int = 2;
		dec_w = 3;
		dec_h = 4;
		minus_w = 6;
		minus_h = 4;
		minus_t = 15;
		break;
	}

	if (num < 0) {
		neg  = 1;
		num *= -1;
	} else neg = 0;

	do buf[i++] = num % 10; while ((num /= 10) > 0);
	strLen = i;
	if (strLen <= Decimals) {
		for (i = strLen; i <= Decimals; i++) buf[i] = 0;
		strLen = Decimals + 1;
	}

	num_width = (dig_w * strLen) + (dig_int * (strLen - 1));
	if (Decimals) num_width += dec_w + dig_int + 1;
	if (neg) num_width += minus_w + dig_int + 1;

	// If X negative -> adjust number left horizontal coordinate
	if (X < 0) xx = (-1 * X) - num_width + 1;

	// If Y negative -> adjust number top horizontal coordinate
	if (Y < 0) Y = (-1 * Y) - dig_h + 1;

	// Draw minus only if number is non zero
	if (neg && Number) {
		FillRect(xx,Y + minus_t,xx + minus_w,Y + minus_t + minus_h,PSet);
		xx += minus_w + dig_int + 1;
	}

	// Draw number
	for (i = 0; i < strLen; i++) {
		GUI_DrawBitmap(xx,Y,dig_w,dig_h,&dig_offset[dig_len * buf[strLen - i - 1]]);
		xx += dig_w + dig_int;
		if (strLen - i - 1 == Decimals && Decimals) {
			// Decimal point
			FillRect(xx,Y + dig_h - dec_h,xx + dec_w,Y + dig_h - 1,PSet);
			xx += dec_w + dig_int + 1;
		}
	}
}

// Draw time
// input:
//   X, Y - left top corner coordinates
//   RTC_Time - number to display (0..65535)
//   TimeType - time format (TT_full or TT_short)
//   DigitSize - type of digit (DS_Big, DS_Mid, DS_Small)
// Small size: 71 x 18 | 45 x 18
// Mid size:   77 x 21 | 50 x 21
// Big size:  104 x 34 | 67 x 34
void GUI_DrawTime(uint8_t X, uint8_t Y, RTC_TimeTypeDef *RTC_Time, TimeType_TypeDef TimeType, DigitSize_TypeDef DigitSize) {
	uint8_t dig1,dig2;
	uint8_t dig_w;

	switch(DigitSize) {
	case DS_Mid:
		dig_w = 12;
		break;
	case DS_Small:
		dig_w = 11;
		break;
	default:
		dig_w = 16;
		break;
	}

	// Hours
	dig1 = RTC_Time->RTC_Hours % 10;
	dig2 = RTC_Time->RTC_Hours / 10;
	switch(DigitSize) {
	case DS_Mid:
		GUI_MidDig(X,Y,dig2);
		GUI_MidDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		FillRect(X,Y + 4,X + 1,Y + 8,PSet);
		FillRect(X,Y + 13,X + 1,Y + 17,PSet);
		break;
	case DS_Small:
		GUI_SmallDig(X,Y,dig2);
		GUI_SmallDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		FillRect(X,Y + 3,X + 1,Y + 7,PSet);
		FillRect(X,Y + 11,X + 1,Y + 15,PSet);
		break;
	default:
		GUI_BigDig(X,Y,dig2);
		GUI_BigDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		FillRect(X,Y + 8,X + 2,Y + 11,PSet);
		FillRect(X,Y + 22,X + 2,Y + 25,PSet);
		break;
	}

	// Minutes
	X += 4;
	dig1 = RTC_Time->RTC_Minutes % 10;
	dig2 = RTC_Time->RTC_Minutes / 10;
	switch(DigitSize) {
	case DS_Mid:
		GUI_MidDig(X,Y,dig2);
		GUI_MidDig(X + dig_w,Y,dig1);
		if (TimeType == TT_Full) {
			X += dig_w * 2;
			FillRect(X,Y + 4,X + 1,Y + 8,PSet);
			FillRect(X,Y + 13,X + 1,Y + 17,PSet);
		}
		break;
	case DS_Small:
		GUI_SmallDig(X,Y,dig2);
		GUI_SmallDig(X + dig_w,Y,dig1);
		if (TimeType == TT_Full) {
			X += dig_w * 2;
			FillRect(X,Y + 3,X + 1,Y + 7,PSet);
			FillRect(X,Y + 11,X + 1,Y + 15,PSet);
		}
		break;
	default:
		X++;
		GUI_BigDig(X,Y,dig2);
		GUI_BigDig(X + dig_w,Y,dig1);
		if (TimeType == TT_Full) {
			X += dig_w * 2;
			FillRect(X,Y + 8,X + 2,Y + 11,PSet);
			FillRect(X,Y + 22,X + 2,Y + 25,PSet);
		}
		break;
	}

	if (TimeType == TT_Short) return;

	// Seconds
	X += 4;
	dig1 = RTC_Time->RTC_Seconds % 10;
	dig2 = RTC_Time->RTC_Seconds / 10;
	switch(DigitSize) {
	case DS_Mid:
		GUI_MidDig(X,Y,dig2);
		GUI_MidDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		break;
	case DS_Small:
		GUI_SmallDig(X,Y,dig2);
		GUI_SmallDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		break;
	default:
		X++;
		GUI_BigDig(X,Y,dig2);
		GUI_BigDig(X + dig_w,Y,dig1);
		X += dig_w * 2;
		break;
	}
}

