LonelyWolf/stm32/bike-computer/GUI.c
		UC1701_Fill(0x00);

		// Draw scale
		HLine(0,scr_width - 1,50,PSet);
		VLine(scr_width - 9,0,63,PSet);
		for (i = 0; i < 5; i++) {
			PutIntULZ3x5(scr_width - 7,44 - (i * 11),i * (max_SNR / 4),2);
			SetPixel(scr_width - 10,i * 11 + 2);
		}
		for (i = 0; i < 11; i++) VLine(8 + (i * 10),51,63,PSet);

		if (!GPSData.sats_view) {
			// Just for decoration
			X = PutStr(12,21,"No satellites",fnt5x7);
			for (i = 0; i < 12; i++) PutIntULZ3x5(i * 10,52,0,2);
		} else {
			// Satellites SNR graphs
			for (i = 0; i < sats; i++) {
				X = i * 10;
				if (GPS_sats_view[i].SNR != 255) {
					Y = 48 - ((GPS_sats_view[i].SNR * 48) / max_SNR);
					if (GPS_sats_view[i].used) FillRect(X,Y,X + 6,50,PSet); else Rect(X,Y,X + 6,50,PSet);
				}
				PutIntULZ3x5(X,52,GPS_sats_view[i].PRN,2);
				if (GPS_sats_view[i].SNR != 255) PutIntULZ3x5(X,59,GPS_sats_view[i].SNR,2);
			}
		}

		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GPS_new_data,0); else return;
		GPS_new_data = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Screen with RAW GPS values
// input:
//   WaitForKey - function pointer to WaitForKeyPress function
// note: if WaitForKey are NULL - just draw screen and return
void GUI_Screen_GPSInfo(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;

	do {
		ClearKeys();

		// Frame
		UC1701_Fill(0x00);
		Rect(0,0,scr_width - 1,scr_height - 1,PSet);

		X = 4; Y = 4;
		X += GUI_PutTimeSec(X,Y,GPSData.time,fnt5x7) + 5;
		X += GUI_PutDate(X,Y,GPSData.date,fnt5x7);

		X = 4; Y += 8;
		X += PutStr(X,Y,"Fix:",fnt5x7) - 1;
		if (GPSData.fix != 2 && GPSData.fix != 3)
			X += PutStr(X,Y,"NA",fnt5x7) + 5;
		else {
			X += PutInt(X,Y,GPSData.fix,fnt5x7);
			X += PutChar(X,Y,'D',fnt5x7);
			X += 5;
		}
		X += PutStr(X,Y,"Qlty:",fnt5x7) - 1;
		X += PutChar(X,Y,GPSData.fix_quality + '0',fnt5x7);
		X += 5;
		X += PutStr(X,Y,"Mode:",fnt5x7) - 1;
		PutChar(X,Y,GPSData.mode,fnt5x7);

		X = 4; Y += 8;
		GUI_PutCoord(X,Y,GPSData.latitude_degree,GPSData.latitude_seconds,GPSData.latitude_char,fnt5x7);
		X = 67;
		GUI_PutCoord(X,Y,GPSData.longitude_degree,GPSData.longitude_seconds,GPSData.longitude_char,fnt5x7);

		X = 4; Y += 8;
		X += PutStr(X,Y,"Alt:",fnt5x7) - 1;
		X += PutInt(X,Y,GPSData.altitude,fnt5x7) + 5;
		X += PutStr(X,Y,"Spd:",fnt5x7) - 1;
		X += PutIntF(X,Y,GPSData.speed,2,fnt5x7);

		X = 4; Y += 8;
		X += PutStr(X,Y,"Crs:",fnt5x7) - 1;
		X += PutIntF(X,Y,GPSData.course,2,fnt5x7) + 5;
		X += PutStr(X,Y,"Sat:",fnt5x7) - 1;
		X += PutInt(X,Y,GPSData.sats_used,fnt5x7);
		X += PutChar(X,Y,'/',fnt5x7);
		X += PutInt(X,Y,GPSData.sats_view,fnt5x7);

		X = 4; Y += 8;
		X += PutStr(X,Y,"PDOP:",fnt5x7) - 1;
		X += PutIntF(X,Y,GPSData.PDOP,2,fnt5x7) + 5;

		X = 4; Y += 8;
		X += PutStr(X,Y,"HDOP:",fnt5x7) - 1;
		X += PutIntF(X,Y,GPSData.HDOP,2,fnt5x7) + 5;
		X += PutStr(X,Y,"VDOP:",fnt5x7) - 1;
		X += PutIntF(X,Y,GPSData.VDOP,2,fnt5x7) + 5;

		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GPS_new_data,0); else return;
		GPS_new_data = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Display byte buffer with scroll
// input:
//   pBuf - pointer to byte buffer
//   BufSize - size of buffer
//   UpdateFlag - pointer to bool variable which contains flag to refresh buffer content
void GUI_Screen_Buffer(uint8_t *pBuf, uint16_t BufSize, bool *UpdateFlag, funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;
	uint16_t pos = 0;
	uint16_t i;
	uint8_t chars_per_line;

	chars_per_line = scr_width / 6;

	do {
		UC1701_Fill(0x00);

		X = 0; Y = 0;
		i = pos;
		do {
			X += PutChar(X,Y,pBuf[i++],fnt5x7);
			if (X > scr_width - 6) {
				X  = 0;
				Y += 8;
			}
		} while (Y < scr_height - 8 && i < BufSize);
		HLine(0,scr_width - 1,scr_height - 7,PSet);

		X = PutIntULZ3x5(0,scr_height - 5,pos,0) + 10;
		PutIntULZ3x5(X,scr_height - 5,BufSize,0);

		UC1701_Flush();

		// Wait for key press
		if (WaitForKey) WaitForKey(TRUE,UpdateFlag,0);
		*UpdateFlag = FALSE;

		// "Down" key
		if (BTN[BTN_DOWN].cntr > 0 || BTN[BTN_DOWN].state == BTN_Hold) {
			if (pos + i < BufSize) {
				pos += chars_per_line;
				if (pos > BufSize) pos = BufSize;
			}
			BTN[BTN_DOWN].cntr = 0;
		}
		// "Up" key
		if (BTN[BTN_UP].cntr > 0 || BTN[BTN_UP].state == BTN_Hold) {
			pos -= chars_per_line;
			if (pos > BufSize) pos = 0;
			BTN[BTN_UP].cntr = 0;
		}
		// "Enter" key
		if (BTN[BTN_ENTER].cntr > 0 || BTN[BTN_ENTER].state == BTN_Hold) {
			pos = 0;
			BTN[BTN_ENTER].cntr = 0;
		}
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Draw speed with 'km/h' mark and AVG speed pace indicator
// input:
//   X, Y - left top corner coordinates
//   speed - speed value (max 999 -> 99.9 km/h)
//   avg - average speed value for pace indicator
// Size: 54 x 33
void GUI_DrawSpeed(int8_t X, int8_t Y, uint32_t speed, uint32_t avg) {
	if (speed > 999) speed = 999;
	FillRect(X,Y,X + 54,Y + 33,PReset);
	GUI_DrawNumber(-(X + 29),Y,speed / 10,0,DS_Big);
	FillRect(X + 31,Y + 31,X + 33,Y + 33,PSet);
	GUI_SmallDig(X + 35,Y + 15,speed % 10);
	GUI_DrawBitmap(X + 34,Y + 3,20,10,&bmp_kmph[0]);
	if (speed > 0) {
		if (avg <= speed) {
			// Up pace arrow
			GUI_DrawBitmap(X + 46,Y + 18,9,13,&bmp_pace_arrow[0]);
		} else {
			// Down pace arrow
			GUI_DrawBitmap(X + 46,Y + 18,9,13,&bmp_pace_arrow[18]);
		}
	}
}

// Draw ride time (in seconds)
// input:
//   X, Y - left top corner coordinates
//   time - time in seconds (max value 359999 -> 99:59:59)
void GUI_DrawRideTime(uint8_t X, uint8_t Y, uint32_t time) {
	uint16_t hours;
	uint8_t minutes,seconds;

	hours   = time / 3600;
	minutes = (time / 60) % 60;
	seconds = time % 60;
	if (hours > 99) {
		hours   = 99;
		minutes = 59;
		seconds = 59;
	}

	// Hours
	GUI_SmallDig(X,Y,hours / 10);
	GUI_SmallDig(X + 10,Y,hours % 10);
	X += 20;
	FillRect(X,Y + 3,X + 1,Y + 7,PSet);
	FillRect(X,Y + 11,X + 1,Y + 15,PSet);
	X += 3;

	// Minutes
	GUI_SmallDig(X,Y,minutes / 10);
	GUI_SmallDig(X + 10,Y,minutes % 10);
	X += 20;
	FillRect(X,Y + 3,X + 1,Y + 7,PSet);
	FillRect(X,Y + 11,X + 1,Y + 15,PSet);
	X += 3;

	// Seconds
	GUI_SmallDig(X,Y,seconds / 10);
	GUI_SmallDig(X + 10,Y,seconds % 10);
}

// Draw graph
// input:
//   X, Y - top left corner coordinates
//   W, H - width and height of graph
//   data - pointer to array with graph values
//   GraphType - type of graph (GT_dot, GT_fill, GT_line)
// note: values array must be equal to or less than graph width
void GUI_DrawGraph(uint8_t X, uint8_t Y, uint8_t W, uint8_t H, const int16_t* data, GraphType_TypeDef GraphType) {
	uint8_t i,bY,pY,YY,offset;
	int16_t min,max;
	float mY;

